#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/SCStest/bigip-ci/runs/run-f8xvztRor9CokSQr

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
bigip_as3.DeployApp: Refreshing state... [id=My_Protected_App]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_as3.DeployApp will be created
  + resource "bigip_as3" "DeployApp" {
      + application_list = (known after apply)
      + as3_json         = jsonencode(
            {
              + action      = "deploy"
              + class       = "AS3"
              + declaration = {
                  + My_Protected_App = {
                      + App   = {
                          + My_ASM_Policy = {
                              + class         = "WAF_Policy"
                              + ignoreChanges = true
                              + url           = "https://raw.githubusercontent.com/scshitole/more-terraform/master/Sample_app_sec_02_waf_policy.xml"
                            }
                          + class         = "Application"
                          + serviceMain   = {
                              + class              = "Service_HTTP"
                              + persistenceMethods = []
                              + policyWAF          = {
                                  + use = "My_ASM_Policy"
                                }
                              + pool               = "web_pool"
                              + profileMultiplex   = {
                                  + bigip = "/Common/oneconnect"
                                }
                              + virtualAddresses   = [
                                  + "10.0.0.200",
                                ]
                              + virtualPort        = 8080
                            }
                          + template      = "http"
                          + web_pool      = {
                              + class    = "Pool"
                              + members  = [
                                  + {
                                      + addressDiscovery = "consul"
                                      + jmesPathQuery    = "[*].{id:Node.Address,ip:{private:Node.Address,public:Node.Address},port:Service.Port}"
                                      + servicePort      = 80
                                      + updateInterval   = 10
                                      + uri              = "http://10.0.0.100:8500/v1/health/service/app?passing"
                                    },
                                ]
                              + monitors = [
                                  + "http",
                                ]
                            }
                        }
                      + class = "Tenant"
                    }
                  + class            = "ADC"
                  + id               = "Protected_App"
                  + schemaVersion    = "3.24.0"
                }
              + persist     = true
            }
        )
      + id               = (known after apply)
      + tenant_list      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @scshitole, Action: `pull_request`*